In [4]:
#installing necessary packages
%pip install pyodbc
%pip install python-dotenv

In [5]:
#Importing all the necessary packages
import pyodbc #just installed with pip
import os
from dotenv import dotenv_values #import the dotenv_values function from the dotenv package
import pandas as pd
import warnings


warnings. filterwarnings('ignore')

In [6]:
# Load environment variables from .env file into a dictionary
environment_variables = dotenv_values('.env')

# Get the values for the credentials you set in the '.env' file
database = environment_variables.get("DB_NAME")

server = environment_variables.get("DB_SERVER")
username = environment_variables.get("SQL_DB_LOGIN")
password = environment_variables.get("DB_PASS")

connection_string = f"DRIVER={{SQL Server}} ; SERVER={server}; DATABASE={database}; UID={username} ; PWD={password}"

In [7]:
# Use the connect method of the pyodbc library and pass in the connection string.

connection = pyodbc.connect( connection_string)

# Now the sql query to get the data is what what you see below.

In [8]:
#Querying the database to retrieve all relevant files from table 1
query1 = "SELECT * FROM dbo.LP1_startup_funding2020"
df_2020 = pd.read_sql(query1, connection)

In [9]:
#Querying the database to retrieve all relevant files from table 2
query2 = "SELECT * FROM dbo.LP1_startup_funding2021"

df_2021 = pd.read_sql(query2, connection)

In [10]:
# Renaming columns to lowercase with underscores
df_2020= df_2020.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2020.head(2)

,company_brand,founded,headquarter,sector,what_it_does,founders,investor,amount,stage,column10
0,Aqgromalin,2019.0,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.0,None,None
1,Krayonnz,2019.0,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.0,Pre-seed,None

In [11]:
#performing high level enquiries on the data
df_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  1055 non-null   object
 1   founded        842 non-null    float64
 2   headquarter    961 non-null    object
 3   sector         1042 non-null   object
 4   what_it_does   1055 non-null   object
 5   founders       1043 non-null   object
 6   investor       1017 non-null   object
 7   amount         801 non-null    float64
 8   stage          591 non-null    object
 9   column10       2 non-null      object
dtypes: float64(2), object(8)
memory usage: 82.6+ KB

From the observations, there are strings and numbers in the dataset. There are 10 columns in the 2020_dataset with nulls in almost all of them.

In [12]:
# Rename columns to lowercase with underscores
df_2021= df_2021.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2021.head(2)

,company_brand,founded,headquarter,sector,what_it_does,founders,investor,amount,stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",None

In [13]:
#performing high level enquiries on the second dataset
df_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1209 entries, 0 to 1208
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  1209 non-null   object
 1   founded        1208 non-null   float64
 2   headquarter    1208 non-null   object
 3   sector         1209 non-null   object
 4   what_it_does   1209 non-null   object
 5   founders       1205 non-null   object
 6   investor       1147 non-null   object
 7   amount         1206 non-null   object
 8   stage          781 non-null    object
dtypes: float64(1), object(8)
memory usage: 85.1+ KB

From the observations, there are strings and numbers in the dataset. There are 9 columns in the 2021_dataset with nulls in almost all of them.

In [14]:
#reading third dataset from csv file into a pandas dataframe
df_2019 = pd.read_csv("startup_funding2019.csv")
# Rename columns to lowercase with underscores
df_2019= df_2019.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2019.head(2)

,company/brand,founded,headquarter,sector,what_it_does,founders,investor,amount($),stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.0,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C

In [15]:
#removing symbols from columns to make later concatenation uniform
df_2019 = df_2019.rename(columns={"company/brand":"company_brand", "amount($)":"amount"})

In [16]:
#requesting info of 2019 dataset
df_2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  89 non-null     object
 1   founded        60 non-null     float64
 2   headquarter    70 non-null     object
 3   sector         84 non-null     object
 4   what_it_does   89 non-null     object
 5   founders       86 non-null     object
 6   investor       89 non-null     object
 7   amount         89 non-null     object
 8   stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

In [22]:
#concatenating three datasets into a single dataframe
df = pd.concat([df_2019,df_2020,df_2021],ignore_index=True)
df.to_csv("startup_2019_2020_2021.csv")

In [18]:
#checking shape of 2019 dataframe
df_2019.shape

(89, 9)

In [19]:
#checking shape of 2020 dataframe
df_2020.shape

(1055, 10)

In [20]:
#checking shape of 2021 dataframe
df_2021.shape

(1209, 9)